package common

import (
	"crypto/rand"
	"fmt"
	"math/big"
)

var (
	surnames = []string{
		"Черемных", "Иванов", "Смирнов", "Кузнецов", "Попов", "Васильев", "Петров", "Соколов", "Михайлов", "Новиков",
		"Федоров", "Морозов", "Волков", "Алексеев", "Лебедев", "Семенов", "Егоров", "Павлов", "Козлов", "Степанов",
		"Николаев", "Орлов", "Андреев", "Макаров", "Никитин", "Захаров", "Зайцев", "Соловьев", "Борисов", "Яковлев",
		"Григорьев", "Романов", "Воробьев", "Сергеев", "Кузьмин", "Фролов", "Ковалев", "Киселев", "Поляков", "Сафонов",
		"Кудрявцев", "Баранов", "Фомин", "Ермаков", "Архипов", "Белов", "Медведев", "Антонов", "Тарасов", "Власов",
		"Жуков", "Комаров", "Данилов", "Матвеев", "Евдокимов", "Афанасьев", "Лазарев", "Румянцев", "Марков", "Гусев",
		"Кондратьев", "Титов", "Беляев", "Тимофеев", "Логинов", "Краснов", "Игнатьев", "Одинцов", "Филиппов", "Рожков",
		"Мартынов", "Корнилов", "Гурьев", "Громов", "Пономарев", "Щербаков", "Колесников", "Королев", "Одинцов", "Суворов",
		"Калинин", "Петухов", "Беляков", "Куликов", "Лаврентьев", "Елисеев", "Полянин", "Коновалов", "Пономаренко", "Соболев",
		"Савельев", "Шестаков", "Суханов", "Кошелев", "Панфилов", "Денисов", "Савелов", "Рябов", "Миронов", "Осипов",
		"Карпов", "Власов", "Сазонов", "Коротаев", "Русаков", "Блинов", "Гущин", "Лукин", "Мухин", "Овчинников",
	}

	firstNames = []string{
		"Владимир", "Александр", "Сергей", "Андрей", "Дмитрий", "Алексей", "Максим", "Евгений", "Иван", "Михаил",
		"Артем", "Николай", "Игорь", "Денис", "Павел", "Антон", "Виталий", "Олег", "Юрий", "Роман",
		"Вячеслав", "Василий", "Кирилл", "Илья", "Виктор", "Анатолий", "Вадим", "Константин", "Григорий", "Никита",
		"Эдуард", "Станислав", "Георгий", "Борис", "Валерий", "Леонид", "Артур", "Тимур", "Егор", "Руслан",
		"Ярослав", "Даниил", "Петр", "Федор", "Степан", "Глеб", "Матвей", "Тимофей", "Ростислав", "Геннадий",
		"Арсений", "Герасим", "Захар", "Всеволод", "Марк", "Давид", "Святослав", "Филипп", "Григорий", "Валентин",
		"Архип", "Владлен", "Мирослав", "Вячеслав", "Елисей", "Назар", "Прохор", "Платон", "Тихон", "Герман",
		"Савелий", "Яков", "Родион", "Демьян", "Лука", "Роман", "Вадим", "Макар", "Мирон", "Климент",
		"Анисим", "Богдан", "Всеволод", "Святогор", "Яромир", "Гордей", "Еремей", "Тарас", "Демьян", "Игнат",
		"Савва", "Афанасий", "Ефим", "Кондрат", "Пантелей", "Харитон", "Лазарь", "Климентий", "Ростислав", "Емельян",
		"Глеб", "Нифонт", "Семен", "Лаврентий", "Фадей", "Гордей", "Трофим", "Федот", "Кузьма", "Лукьян",
	}
)

// GenerateUsername generates a random surname and first name
func GenerateUsername() string {
	surnameLen := big.NewInt(int64(len(surnames)))
	sIdx, _ := rand.Int(rand.Reader, surnameLen)
	firstNameLen := big.NewInt(int64(len(firstNames)))
	fIdx, _ := rand.Int(rand.Reader, firstNameLen)
	return fmt.Sprintf("%s %s", surnames[sIdx.Int64()], firstNames[fIdx.Int64()])
}
